---
kind: other
id: Properties.T:Autodesk.Revit.DB.HasValueFilterRule
source: html/2b492e02-1c4d-f81e-a2c3-5484a8500d99.htm
---
# HasValueFilterRule Properties

Specifies whether the .NET object represents a valid Revit entity.